Revit 2027 API
BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutFailure Property
 Fail to generate the automatic landing layout
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsAutomaticLandingLayoutFailure { get; }
Public Shared ReadOnly Property StairsAutomaticLandingLayoutFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsAutomaticLandingLayoutFailure {
	FailureDefinitionId^ get ();
}
static member StairsAutomaticLandingLayoutFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace